public class funNeicun {
    public static void main(String[] args){
        /**
         * 方法的内存
         *     1.方法调用的基本内存原理
         *     方法运行时使用的内存，方法进栈运行，运行完毕就出栈
         *     方法进栈的运行规则就是，先进后出原理
         *     2.方法传递基本数据类型的内存原理
         *     3.方法传递引用数据类型的内存原理
         * */

        /**
         * 基本数据类型
         * 整数类型
         * 浮点数类型
         * 布尔类型
         * 字符类型
         * */

        /**
         * 除了上面的其他数据类型都是引用数据数据类型
         * 基本数据类型存放在栈中
         * 引用数据类型存放在堆中，而栈中存储的是在堆中的内存地址
         * 用于指向堆内存中这一个引用类型
         * */
    }
}

